Тест/Тест/src/Enums/СтатусЗакупкиТовара/СтатусЗакупкиТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗакупкиТовара</name>
  <enumValues>
    <name>ОжидаемПоступление</name>
  </enumValues>
  <enumValues>
    <name>Поступил</name>
  </enumValues>
  <enumValues>
    <name>КРассмотрению</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/ЗакупкаТовара/ЗакупкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТовара</name>
  <basedOn>Document.ЗаявкаЗакупкаТовара</basedOn>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаЗакупкаТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.ТранспротнаяКомпания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрекНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Т_Т</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_Т</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Т_Д</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_Д</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправления</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПрибытия</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗакупки</name>
    <type>
      <types>EnumRef.СтатусыЗаявкаЗакупкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗабралиВТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗабралиВТК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупленныйТовар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПоступления</name>
      <type>
        <types>EnumRef.СтатусЗакупкиТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеДетали</name>
      <type>
        <types>CatalogRef.ПроектыРазработки</types>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>String</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБЕЗНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/CommonForms/СписокЗакупленногоТовара/Module.bsl
&НаКлиенте
Процедура СоздатьДокументЗакупка(Команда)
/// Комлев АА 25/11/24 +++
	ОткрытьФорму("Документ.ЗакупкаТовара.ФормаСписка");
	ФормаЗакупка = ОткрытьФорму("Документ.ЗакупкаТовара.Форма.ФормаДокумента");
	ФормаЗакупка.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	ФормаЗакупка.ОбновитьОтображениеДанных();
/// Комлев АА 25/11/24 ---
КонецПроцедуры


&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Фильтр = 1 Тогда
		ТекстЗапросаПоступил();
	Иначе
		ТекстЗапросаОжидаем();
	КонецЕсли;
КонецПроцедуры

Процедура ТекстЗапросаПоступил()
	/// Комлев АА 25/11/24 +++
	Текст = "ВЫБРАТЬ
			|	ЗакупкаТовараЗакупленныйТовар.Товар,
			|	ЗакупкаТовараЗакупленныйТовар.Код,
			|	ЗакупкаТовараЗакупленныйТовар.Артикул,
			|	ЗакупкаТовараЗакупленныйТовар.Производитель,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка КАК ЗаказДеталей,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка.Поставщик,
			|	ЗакупкаТовараЗакупленныйТовар.НазначениеДетали,
			|	ЗакупкаТовараЗакупленныйТовар.Количество,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаПродажи,
			|	ЗакупкаТовараЗакупленныйТовар.Прибыль,
			|	ЗакупкаТовараЗакупленныйТовар.СуммаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления
			|ИЗ
			|	Документ.ЗакупкаТовара.ЗакупленныйТовар КАК ЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления = ЗНАЧЕНИЕ(Перечисление.СтатусЗакупкиТовара.Поступил)";

	СписокЗакупленногоТовара.ПроизвольныйЗапрос = Истина;
	СписокЗакупленногоТовара.ТекстЗапроса = Текст;

	Элементы.СписокЗакупленногоТовара.Обновить();
	/// Комлев АА 25/11/24 ---
КонецПроцедуры

Процедура ТекстЗапросаОжидаем()
	/// Комлев АА 25/11/24 +++
	Текст = "ВЫБРАТЬ
			|	ЗакупкаТовараЗакупленныйТовар.Товар,
			|	ЗакупкаТовараЗакупленныйТовар.Код,
			|	ЗакупкаТовараЗакупленныйТовар.Артикул,
			|	ЗакупкаТовараЗакупленныйТовар.Производитель,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка КАК ЗаказДеталей,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка.Поставщик,
			|	ЗакупкаТовараЗакупленныйТовар.НазначениеДетали,
			|	ЗакупкаТовараЗакупленныйТовар.Количество,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаПродажи,
			|	ЗакупкаТовараЗакупленныйТовар.Прибыль,
			|	ЗакупкаТовараЗакупленныйТовар.СуммаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления
			|ИЗ
			|	Документ.ЗакупкаТовара.ЗакупленныйТовар КАК ЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления = ЗНАЧЕНИЕ(Перечисление.СтатусЗакупкиТовара.ОжидаемПоступление)
			|	ИЛИ ЗакупкаТовараЗакупленныйТовар.СтатусПоступления = ЗНАЧЕНИЕ(Перечисление.СтатусЗакупкиТовара.ОтказВПоставке)";

	СписокЗакупленногоТовара.ПроизвольныйЗапрос = Истина;
	СписокЗакупленногоТовара.ТекстЗапроса = Текст;

	Элементы.СписокЗакупленногоТовара.Обновить();
	/// Комлев АА 25/11/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Фильтр = 1;
КонецПроцедуры
&НаКлиенте
Процедура СписокЗакупленногоТовараВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
/// Комлев АА 25/11/24 ---
	Если Поле = Элементы.СписокЗакупленногоТовараЗаказДеталей Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.ЗаказДеталей);
			ОткрытьФорму("Документ.ЗакупкаТовара.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли Поле = Элементы.СписокЗакупленногоТовараТовар Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Товар);
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		КонецЕсли;
		Элементы.СписокЗакупленногоТовара.Обновить();
	КонецЕсли;
	/// Комлев АА 25/11/24 ---
КонецПроцедуры
